Revit 2026 API

# BoundaryValidationIsValidBoundaryOnSketchPlane Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidBoundaryOnSketchPlane(
	SketchPlane sketchPlane,
	IList<CurveLoop> curveLoops
)
```
```vb
Public Shared Function IsValidBoundaryOnSketchPlane (
	sketchPlane As SketchPlane,
	curveLoops As IList(Of CurveLoop)
) As Boolean
```
```cpp
public:
static bool IsValidBoundaryOnSketchPlane(
	SketchPlane^ sketchPlane,
	IList<CurveLoop^>^ curveLoops
)
```
```fsharp
static member IsValidBoundaryOnSketchPlane :
        sketchPlane : SketchPlane *
        curveLoops : IList<CurveLoop> -> bool
```

#### Parameters

sketchPlane SketchPlane

curveLoops IListCurveLoop

#### Return Value

Boolean

#### Reference

BoundaryValidation Class

Autodesk.Revit.DB Namespace